console.clear();
//Вхідний масив
let myArray = [1, 4, -22, -22, 14, 4, 12.23, 2 * 4];
let arraySum = 0;
console.log('Вхідні значення:');
console.log(myArray);
//Якщо масив це масив (не null або undefined) та має більше ніж 1 елемент то:
if (Array.isArray(myArray) && myArray.length > 1) {
	//Сортуємо за зростанням (параметри для sort знайдено за допомогою гугла, бо інакше сотруе як string)
	myArray = myArray.sort((a, b) => a - b);
	console.log(myArray);
	//Тут ріжемо голову і хвоста, а саме мінімальне і максимальне значення
	myArray.pop();
	myArray.shift();
	//Рахуємо суму
	arraySum = myArray.reduce((sum, current) => sum + current, 0);
	console.log('Результат: ' + arraySum);
}
//Інакше сума = 0 і виводимо.
else {
	arraySum = 0;
	console.log('Результат: ' + arraySum);
}

//В умові сказано, що масив має бути більше 1 елементу, хоча навіть якщо елементів буде 2, воно все одно поверне 0. Тут вже
//постановка задачі така. Ну і те що після виконання у нас масив зменьшився на 2 елементи не дуже гарно, але умова була
//вивести суму, а не зберегти масив :D По гарному можно було знайти макс і мін елемент у масиві через Math.max та Math.min
//і у кінці відняти їх від загальної суми, але гадаю тут не принципово.
