console.clear();
// Завдання 2: Конкатенація радків та шаблонний рядок

// Створіть дві змінні, які містять імена двох осіб.
// Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб.
// Виведіть результат в консоль.
// Потім використайте шаблонний рядок для створення того ж вітання.
// Виведіть результат в консоль.

let bride = 'Щур Марія Степанівна';
let groom = 'Влип Олег Максимович';
let cheer = `Шановні ${bride} та ${groom}! Вітаємо вас на борту цього щасливого корабля під назвою 'Життя'!`;
console.log(cheer);
console.log('А ще ' + bride + ' та ' + groom + ' не забудьте оплатити послуги фотографа!');
