console.clear();
// Завдання 4: Обчислення площі та об'єму

// Завдання 4.1
// π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа
// Створіть змінну radius і присвойте їй числове значення радіуса кола.
// Обчисліть площу кола за формулою π * radius^2 і виведіть результат.
let radius = 4.4;
console.log("Довжина окружності кола з радіусом " + radius + " = "+ (Math.PI*radius*radius).toFixed(2));

// Завдання 4.2

// Створіть змінну length і присвойте їй числове значення довжини прямокутника.
// Створіть змінну width і присвойте їй числове значення ширини прямокутника.
// Обчисліть площу прямокутника за формулою length * width і виведіть результат.
let lenght = 5;
let width = 8.123;
console.log("Площа прямокутника зі сторонами " + lenght + " та "+width+" дорівнює " + (lenght*width).toFixed(2));

// Завдання 4.3

// Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
// Створіть змінну height і присвойте їй числове значення висоти циліндра.
// Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.

radius = 4.15;
let height = 8.2155;
console.log("Об'єм циліндру з радіусом " + radius+" та висотою " + height + " дорівнює " + (Math.PI*radius*radius*height).toFixed(2));