console.clear();
// Завдання 3: Числа та булі

// Створіть змінну яка буде символізувати вік певної персони.
// Після чого створіть булеву змінну яка буде визначати чи особа повнолітня базуючись на заченні з попередньої змінної.
// Виведіть усі змінні в консоль

let customerAge = 15;
let isAdult = customerAge >= 18;
console.log('Петро Свинопасенко повнолітній? Йому зараз ' + customerAge + ' років. ' + isAdult);

customerAge = customerAge + 5;
isAdult = customerAge >= 18;
console.log(
	'А чи буде Петро Свинопасенко повнолітнім через 5 років? Йому вже буде ' + customerAge + ' років. ' + isAdult,
);
